{
  "-511c5fee": "Immersive Growth Consulting, Done Right.",
  "3d503d2b": "No items found.",
  "234a905": "Our Philosophy",
  "-713b1d8e": "When it comes to growth, we believe that more is involved than just marketing tactics. Our experience has taught us that Growth truly stems from rapid experimentation across multiple departments, such as Product, Marketing, Sales, Customers Success, and even Leadership in some cases.",
  "-13a2bfe8": "Growth is driven by a companywide cultural shift in perspective and we focus on inspiring this perspective for the teams that we work with.  Every company needs a unique growth strategy specific to its culture, brand, and audience. There is no one size fits all.",
  "2c7c7737": "case studies",
  "-50574bc": "The results speak for themselves",
  "162663f0": "View More",
  "819763c": "Our Approach",
  "4c6c0ce2": "Our team focuses on inside-out growth strategies that truly create a long-term change within our clients. In most cases, our clients are already growing, or have grown in the past. They typically hit a plateau and they can never seem to understand why.",
  "-16eddda1": "The team at GrowthMeta is comprised of strategist that have backgrounds in a wide range of area. These areas consist of Marketing, Sales, Customer Success, User Experience Design, Product Managers, and of course, Engineers. We don't believe that Growth is a marketing and sales problem, we believe that it's a product market fit issue in most cases. Every client is unique and we take an extensive approach to diagnosis the root issues, create formula's for growth, then execute experimentation until we find what works for your target audience.",
  "7038a590": "Discovery",
  "1d213ead": "Team Interviews & Data Analysis",
  "3d8d64e": "Build",
  "-435285a2": "Hypothesize & Experiments",
  "-6bfe11c6": "Sprint",
  "-46fa1147": "Agile Experiment Execution",
  "-3c32da32": "In most cases, this is due to the organization lacking fresh perspectives. An organization without a fresh perspective of their product and target market leads to essentially growth within a box. You cannot find more customers because you have limited your customer base, when in reality there is a multitude of markets available for the taking.",
  "2837b961": "We start with re-engineering your current perspective of success. We want to know what you seek from our team and we work backwards. This allows our team to strategically analyze a wide range of factors during discovery, which will lead to many new learnings and perspectives. These learnings, will drive the next phase of innovation for your business.",
  "50e1e74": "Interested In Growth?",
  "2e0ba6cc": "Download our ",
  "-10f31ccd": "Growth Checklist ",
  "3de3d0ee": "and get started",
  "2e": ".",
  "143d1446": "Congrats, your ",
  "7310ee8d": "Growth Checklist",
  "479ff0ac": " is on the way!",
  "5e8b37c5": "Oops! Something went wrong.",
  "-5e451b2a": "Quality Over Quantity",
  "-5730522e": "GrowthMeta is an immersive consultancy, which means that we dive deep into your companies culture, history, products, roadmaps, marketing strategies, and more. Due to the intensity that we immerse, we only work with a maximum of 6 clients.",
  "3bc7517e": "These 6 clients range based on their current stages. We take this approach so that we can keep current as practitioners of companies of all sizes. Our client breakdown typically consists of four companies that have between 75 and 500 employees, that have either raised a Series A or bootstrapped and built off success. Then, we also take at least two clients that have between 10 and 50 employees, that are currently in the pre-seed or seed stage.",
  "4379ec4": "Our Focus",
  "32220a59": "The growth lifecycle is vast, it includes many areas of the company beyond marketing. We take a unique approach that includes establishing key goals, then extracting opportunities and issues from the team in-order to build a baseline for accountability. ",
  "-70a3e71c": "Sprint Lifecycle",
  "-5d0ca1c3": "How It Works",
  "33158fd7": "Everything our team does is based on Agile processes. We believe that failing as fast as possible is the best way to identify new opportunities. This helps our clients get out of the process of thinking and into the process of doing.",
  "-7a935b3d": "Want Growth Resources?",
  "5d8d8c8e": "Learn about what our team is doing in the Growth space for top brands. We'll provide you with the insights required to Grow.",
  "-364d0a89": "Get Started",
  "799978fe": "Looking To Work Together?",
  "-8de2088": "We're happy to chat about how we can help your team achieve key growth objectives.",
  "7f2746de": "Contact Us",
  "6f5d8a6d": "Copyright 2021 © GrowthMeta",
  "-711500fa": "Designed by ",
  "14a92214": "Everyway",
  "-13f6fc6f": "Let's Chat",
  "-4ed778ce": "Our work results speak by themselves.",
  "-263cd9df": "We help top startups, brands, and technology companies Growth through experimentation and agile implementation.",
  "4debde87": "Learn About the Latest Growth Resources",
  "-7e37e685": "Nice, you're subscribed, we'll send you over what's happening in Growth Weekly."
}